/******************************************************************************/
//  GeekWorld
//  Author: fys3@163.com 
//  Version: 0.0
//  Date: 2013/05/11 22:17
//*****************************************************************************/
#include "v_menu.h"
#include "text.h"
#include "sys.h"
#include "delay.h"
#include "stdio.h"
#include "string.h"
#include "v_lcd.h"
#include "uart_timer.h"

//#define DEBUG

#define V_MENU_LANGUAGE_EN		0x00
#define V_MENU_LANGUAGE_CN		0x01

#define V_MENU_DISPLAY_FORMAT_FLOW_L      	0x00
#define V_MENU_DISPLAY_FORMAT_PULSE		0x01
#define V_MENU_SETTING_LOCAL_SHOW_ALL_TIME	3600	//60m

#define V_MENU_SENSOR_STATUS_NOT_IN_USE		0x00
#define V_MENU_SENSOR_STATUS_NORMAL			0x01
#define V_MENU_SENSOR_STATUS_ERROR			0x02
#define V_MENU_SHOW_STATUS_NORMAL			0x00
#define V_MENU_SHOW_STATUS_ERROR			0xFFFFFFFF
#define V_MENU_SHOW_STATUS_ABNORMAL			0xFFFFFFFE
#define V_MENU_SHOW_STATUS_INVALID			0xFFFFFFFD

typedef struct v_menu_struct
{ 
	struct v_menu_struct *enter_menu;
	struct v_menu_struct *esc_menu;
	struct v_menu_struct *up_menu;
	struct v_menu_struct *down_menu;
	void (*do_function) (void);
	void (*menu_show)(void);
}v_menu_struct_t;

//local variables
static v_menu_struct_t *v_cur_menu;

static uint8_t v_menu_in_display = 1;		//in diplay flag
static uint32_t v_menu_show_last_value_0;
static uint32_t v_menu_show_last_value_1;
static uint32_t v_menu_show_error_count_0;
static uint32_t v_menu_show_error_count_1;

uint32_t v_menu_language;					//0x0E
uint32_t v_menu_display_format;				//0x11
uint32_t v_menu_show_all_time;				//0x20
//like datasheet
uint32_t v_sensor_work_mode;
uint32_t v_sensor_error_delay_time;			//0x18
//0: no alarm 1:alarm
uint32_t v_sensor_instant_fuel_consum_1_alarm; //0x1A
uint32_t v_sensor_instant_fuel_consum_2_alarm; //0x1B

uint32_t v_sensor_fuel_consum_sample_time;	//0x19
uint32_t v_sensor_flow_smaple_time;			//0x09
uint32_t v_fuel_consum_1_correct;			 	//0x3C|0x3F
uint32_t v_fuel_consum_2_correct;
//0:not in use 1:normal 2:abnormal
uint32_t v_sensor_A_status;
uint32_t v_sensor_B_status;
uint32_t v_sensor_C_status;
uint32_t v_sensor_D_status;
uint32_t v_sensor_A_Trip;					 
uint32_t v_sensor_B_Trip;
uint32_t v_sensor_C_Trip;
uint32_t v_sensor_D_Trip;
uint32_t v_sensor_A_Tot;
uint32_t v_sensor_B_Tot;
uint32_t v_sensor_C_Tot;
uint32_t v_sensor_D_Tot;
//0x3D
uint32_t v_fuel_consum_1_travel_time;	
uint32_t v_fuel_consum_1_travel_consum;
uint32_t v_fuel_consum_2_travel_time;
uint32_t v_fuel_consum_2_travel_consum;
static uint32_t v_sensor_latest_A_Trip;
static uint32_t v_sensor_latest_A_Tot;
static uint32_t v_sensor_latest_B_Trip;
static uint32_t v_sensor_latest_B_Tot;
static uint32_t v_sensor_latest_C_Trip;
static uint32_t v_sensor_latest_C_Tot;
static uint32_t v_sensor_latest_D_Trip;
static uint32_t v_sensor_latest_D_Tot;
static void reset_all_data(void){
//0:not in use 1:normal 2:abnormal
